zephyrproject-rtos/zephyr/drivers/sensor/adi/max32664c/max32664c.c
/*
 * Copyright (c) 2025, Daniel Kampert
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/sys/byteorder.h>

#include "max32664c.h"

#define DT_DRV_COMPAT maxim_max32664c

#if (DT_NUM_INST_STATUS_OKAY(DT_DRV_COMPAT) == 0)
#warning "max32664c driver enabled without any devices"
#endif

LOG_MODULE_REGISTER(maxim_max32664c, CONFIG_SENSOR_LOG_LEVEL);

int max32664c_i2c_transmit(const struct device *dev, uint8_t *tx_buf, uint8_t tx_len,
			   uint8_t *rx_buf, uint32_t rx_len, uint16_t delay_ms)
{
	const struct max32664c_config *config = dev->config;

	/* Wake up the sensor hub before the transmission starts (min. 300 us) */
	gpio_pin_set_dt(&config->mfio_gpio, false);
	k_usleep(500);

	if (i2c_write_dt(&config->i2c, tx_buf, tx_len)) {
		LOG_ERR("I2C transmission error!");
		return -EBUSY;
	}

	k_msleep(delay_ms);

	if (i2c_read_dt(&config->i2c, rx_buf, rx_len)) {
		LOG_ERR("I2C read error!");
		return -EBUSY;
	}

	k_msleep(MAX32664C_DEFAULT_CMD_DELAY);

	/* The sensor hub can enter sleep mode again now */
	gpio_pin_set_dt(&config->mfio_gpio, true);
	k_usleep(300);

	/* Check the status byte for a valid transaction */
	if (rx_buf[0] != 0) {
		return -EINVAL;
	}

	return 0;
}

/** @brief      Check the accelerometer and AFE WHOAMI registers.
 *              This function is called during device initialization.
 *  @param dev  Pointer to device
 *  @return     0 when successful
 */
static int max32664c_check_sensors(const struct device *dev)
{
	uint8_t afe_id;
	uint8_t tx[3];
	uint8_t rx[2];
	struct max32664c_data *data = dev->data;
	const struct max32664c_config *config = dev->config;

	LOG_DBG("Checking sensors...");

	/* Read MAX86141 WHOAMI */
	tx[0] = 0x41;
	tx[1] = 0x00;
	tx[2] = 0xFF;
	if (max32664c_i2c_transmit(dev, tx, 3, rx, 2, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	if (config->use_max86141) {
		LOG_DBG("\tUsing MAX86141 as AFE");
		afe_id = 0x25;
	} else if (config->use_max86161) {
		LOG_DBG("\tUsing MAX86161 as AFE");
		afe_id = 0x36;
	} else {
		LOG_ERR("\tNo AFE defined!");
		return -ENODEV;
	}

	data->afe_id = rx[1];
	if (data->afe_id != afe_id) {
		LOG_ERR("\tAFE WHOAMI failed: 0x%X", data->afe_id);
		return -ENODEV;
	}

	LOG_DBG("\tAFE WHOAMI OK: 0x%X", data->afe_id);

	/* Read Accelerometer WHOAMI */
	tx[0] = 0x41;
	tx[1] = 0x04;
	tx[2] = 0x0F;
	if (max32664c_i2c_transmit(dev, tx, 3, rx, 2, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	data->accel_id = rx[1];
	/* The sensor hub firmware supports only two accelerometers and one is set to */
	/* EoL. The remaining one is the ST LIS2DS12. */
	if (data->accel_id != 0x43) {
		LOG_ERR("\tAccelerometer WHOAMI failed: 0x%X", data->accel_id);
		return -ENODEV;
	}

	LOG_DBG("\tAccelerometer WHOAMI OK: 0x%X", data->accel_id);

	return 0;
}

/** @brief      Stop the current algorithm.
 *  @param dev  Pointer to device
 *  @return     0 when successful
 */
static int max32664c_stop_algo(const struct device *dev)
{
	uint8_t rx;
	uint8_t tx[3];
	struct max32664c_data *data = dev->data;

	if (data->op_mode == MAX32664C_OP_MODE_IDLE) {
		LOG_DBG("No algorithm running, nothing to stop.");
		return 0;
	}

	LOG_DBG("Stop the current algorithm...");

	/* Stop the algorithm */
	tx[0] = 0x52;
	tx[1] = 0x07;
	tx[2] = 0x00;
	if (max32664c_i2c_transmit(dev, tx, 3, &rx, 1, 120)) {
		return -EINVAL;
	}

	switch (data->op_mode) {
	case MAX32664C_OP_MODE_RAW: {
#ifndef CONFIG_MAX32664C_USE_STATIC_MEMORY
		k_msgq_cleanup(&data->raw_report_queue);
#endif /* CONFIG_MAX32664C_USE_STATIC_MEMORY */
		break;
	}
#ifdef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
	case MAX32664C_OP_MODE_ALGO_AEC_EXT:
	case MAX32664C_OP_MODE_ALGO_AGC_EXT: {
#ifndef CONFIG_MAX32664C_USE_STATIC_MEMORY
		k_msgq_cleanup(&data->ext_report_queue);
#endif /* CONFIG_MAX32664C_USE_STATIC_MEMORY */
		break;
	}
#else
	case MAX32664C_OP_MODE_ALGO_AEC:
	case MAX32664C_OP_MODE_ALGO_AGC: {
#ifndef CONFIG_MAX32664C_USE_STATIC_MEMORY
		k_msgq_cleanup(&data->report_queue);
#endif /* CONFIG_MAX32664C_USE_STATIC_MEMORY */
		break;
	}
#endif /* CONFIG_MAX32664C_USE_EXTENDED_REPORTS */
	case MAX32664C_OP_MODE_SCD: {
#ifndef CONFIG_MAX32664C_USE_STATIC_MEMORY
		k_msgq_cleanup(&data->scd_report_queue);
#endif /* CONFIG_MAX32664C_USE_STATIC_MEMORY */
		break;
	}
	default: {
		LOG_ERR("Unknown algorithm mode: %d", data->op_mode);
		return -EINVAL;
	}
	};

	data->op_mode = MAX32664C_OP_MODE_IDLE;

	k_thread_suspend(data->thread_id);

	return 0;
}

/** @brief      Put the device into raw measurement mode.
 *  @param dev  Pointer to device
 *  @return     0 when successful
 */
static int max32664c_set_mode_raw(const struct device *dev)
{
	uint8_t rx;
	uint8_t tx[4];
	struct max32664c_data *data = dev->data;

	/* Stop the current algorithm mode */
	if (max32664c_stop_algo(dev)) {
		LOG_ERR("Failed to stop the algorithm!");
		return -EINVAL;
	}

	LOG_INF("Entering RAW mode...");

	/* Set the output format to sensor data only */
	tx[0] = 0x10;
	tx[1] = 0x00;
	tx[2] = MAX32664C_OUT_SENSOR_ONLY;
	if (max32664c_i2c_transmit(dev, tx, 3, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	/* Enable the AFE */
	tx[0] = 0x44;
	tx[1] = 0x00;
	tx[2] = 0x01;
	tx[3] = 0x00;
	if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, 250)) {
		return -EINVAL;
	}

	/* Enable the accelerometer */
	if (max32664c_acc_enable(dev, true)) {
		return -EINVAL;
	}

	/* Set AFE sample rate to 100 Hz */
	tx[0] = 0x40;
	tx[1] = 0x00;
	tx[2] = 0x12;
	tx[3] = 0x18;
	if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	/* Set the LED current */
	for (uint8_t i = 0; i < sizeof(data->led_current); i++) {
		tx[0] = 0x40;
		tx[1] = 0x00;
		tx[2] = 0x23 + i;
		tx[3] = data->led_current[i];
		LOG_INF("Set LED%d current: %u", i + 1, data->led_current[i]);
		if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			LOG_ERR("Can not set LED%d current", i + 1);
			return -EINVAL;
		}
	}

#ifndef CONFIG_MAX32664C_USE_STATIC_MEMORY
	if (k_msgq_alloc_init(&data->raw_report_queue, sizeof(struct max32664c_raw_report_t),
			      CONFIG_MAX32664C_QUEUE_SIZE)) {
		LOG_ERR("Failed to allocate RAW report queue!");
		return -ENOMEM;
	}
#endif /* CONFIG_MAX32664C_USE_STATIC_MEMORY */

	data->op_mode = MAX32664C_OP_MODE_RAW;

