zephyrproject-rtos/zephyr/drivers/sensor/adi/max32664c/max32664c.c
	k_thread_resume(data->thread_id);

	return 0;
}

/** @brief              Put the sensor hub into algorithm mode.
 *  @param dev          Pointer to device
 *  @param device_mode  Target device mode
 *  @param algo_mode    Target algorithm mode
 *  @param extended     Set to #true when the extended mode should be used
 *  @return             0 when successful
 */
static int max32664c_set_mode_algo(const struct device *dev, enum max32664c_device_mode device_mode,
				   enum max32664c_algo_mode algo_mode, bool extended)
{
	uint8_t rx;
	uint8_t tx[5];
	struct max32664c_data *data = dev->data;

	/* Stop the current algorithm mode */
	if (max32664c_stop_algo(dev)) {
		LOG_ERR("Failed to stop the algorithm!");
		return -EINVAL;
	}

	LOG_DBG("Entering algorithm mode...");

#ifndef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
	if (extended) {
		LOG_ERR("No support for extended reports enabled!");
		return -EINVAL;
	}
#endif /* CONFIG_MAX32664C_USE_EXTENDED_REPORTS */

	/* Set the output mode to sensor and algorithm data */
	tx[0] = 0x10;
	tx[1] = 0x00;
	tx[2] = MAX32664C_OUT_ALGO_AND_SENSOR;
	if (max32664c_i2c_transmit(dev, tx, 3, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	/* Set the algorithm mode */
	tx[0] = 0x50;
	tx[1] = 0x07;
	tx[2] = 0x0A;
	tx[3] = algo_mode;
	if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	if (device_mode == MAX32664C_OP_MODE_ALGO_AEC) {
		LOG_DBG("Entering AEC mode...");

		/* Enable AEC */
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x0B;
		tx[3] = 0x01;
		if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			return -EINVAL;
		}

		/* Enable Auto PD */
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x12;
		tx[3] = 0x01;
		if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			return -EINVAL;
		}

		/* Enable SCD */
		LOG_DBG("Enabling SCD...");
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x0C;
		tx[3] = 0x01;
		if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			return -EINVAL;
		}

		data->op_mode = MAX32664C_OP_MODE_ALGO_AEC;

		if (extended) {
			data->op_mode = MAX32664C_OP_MODE_ALGO_AEC_EXT;
		}
	} else if (device_mode == MAX32664C_OP_MODE_ALGO_AGC) {
		LOG_DBG("Entering AGC mode...");

		/* TODO: Test if this works */
		/* Set the LED current */
		for (uint8_t i = 0; i < sizeof(data->led_current); i++) {
			tx[0] = 0x40;
			tx[1] = 0x00;
			tx[2] = 0x23 + i;
			tx[3] = data->led_current[i];
			LOG_INF("Set LED%d current: %u", i + 1, data->led_current[i]);
			if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1,
						   MAX32664C_DEFAULT_CMD_DELAY)) {
				LOG_ERR("Can not set LED%d current", i + 1);
				return -EINVAL;
			}
		}

		/* Enable AEC */
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x0B;
		tx[3] = 0x01;
		if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			return -EINVAL;
		}

		/* Disable PD auto current calculation */
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x12;
		tx[3] = 0x00;
		if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			return -EINVAL;
		}

		/* Disable SCD */
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x0C;
		tx[3] = 0x00;
		if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			return -EINVAL;
		}

		/* Set AGC target PD current to 10 uA */
		/* TODO: Add setting of PD current via API or DT? */
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x11;
		tx[3] = 0x00;
		tx[4] = 0x64;
		if (max32664c_i2c_transmit(dev, tx, 5, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			return -EINVAL;
		}

		data->op_mode = MAX32664C_OP_MODE_ALGO_AGC;

		if (extended) {
			data->op_mode = MAX32664C_OP_MODE_ALGO_AGC_EXT;
		}
	} else {
		LOG_ERR("Invalid mode!");
		return -EINVAL;
	}

	/* Enable HR and SpO2 algorithm */
	tx[2] = 0x01;
	if (extended) {
		tx[2] = 0x02;
	}

	tx[0] = 0x52;
	tx[1] = 0x07;

	/* Use the maximum time to cover all modes (see Table 6 and 12 in the User Guide) */
	if (max32664c_i2c_transmit(dev, tx, 3, &rx, 1, 500)) {
		return -EINVAL;
	}

#ifndef CONFIG_MAX32664C_USE_STATIC_MEMORY
	if (k_msgq_alloc_init(&data->raw_report_queue, sizeof(struct max32664c_raw_report_t),
			      CONFIG_MAX32664C_QUEUE_SIZE)) {
		LOG_ERR("Failed to allocate RAW report queue!");
		return -ENOMEM;
	}

	if (!extended && k_msgq_alloc_init(&data->report_queue, sizeof(struct max32664c_report_t),
					   CONFIG_MAX32664C_QUEUE_SIZE)) {
		LOG_ERR("Failed to allocate report queue!");
		return -ENOMEM;
	}

#ifdef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
	if (extended &&
	    k_msgq_alloc_init(&data->ext_report_queue, sizeof(struct max32664c_ext_report_t),
			      CONFIG_MAX32664C_QUEUE_SIZE)) {
		LOG_ERR("Failed to allocate extended report queue!");
		return -ENOMEM;
	}
#endif /* CONFIG_MAX32664C_USE_EXTENDED_REPORTS */
#endif /* CONFIG_MAX32664C_USE_STATIC_MEMORY */

	k_thread_resume(data->thread_id);

	return 0;
}

/** @brief      Enable the skin contact detection only mode.
 *  @param dev  Pointer to device
 *  @return     0 when successful
 */
static int max32664c_set_mode_scd(const struct device *dev)
{
	uint8_t rx;
	uint8_t tx[4];
	struct max32664c_data *data = dev->data;

	/* Stop the current algorithm mode */
	if (max32664c_stop_algo(dev)) {
		LOG_ERR("Failed to stop the algorithm!");
		return -EINVAL;
	}

	LOG_DBG("MAX32664C entering SCD mode...");

	/* Use LED2 for SCD */
	tx[0] = 0xE5;
	tx[1] = 0x02;
	if (max32664c_i2c_transmit(dev, tx, 2, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	/* Set the output mode to algorithm data */
	tx[0] = 0x10;
	tx[1] = 0x00;
	tx[2] = MAX32664C_OUT_ALGORITHM_ONLY;
	if (max32664c_i2c_transmit(dev, tx, 3, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	/* Enable SCD only algorithm */
	tx[0] = 0x52;
	tx[1] = 0x07;
	tx[2] = 0x03;
	if (max32664c_i2c_transmit(dev, tx, 3, &rx, 1, 500)) {
		return -EINVAL;
	}

#ifndef CONFIG_MAX32664C_USE_STATIC_MEMORY
	if (k_msgq_alloc_init(&data->scd_report_queue, sizeof(struct max32664c_scd_report_t),
			      CONFIG_MAX32664C_QUEUE_SIZE)) {
		LOG_ERR("Failed to allocate SCD report queue!");
		return -ENOMEM;
	}
#endif /* CONFIG_MAX32664C_USE_STATIC_MEMORY */

	data->op_mode = MAX32664C_OP_MODE_SCD;

