zephyrproject-rtos/zephyr/drivers/sensor/adi/max32664c/max32664c.c
	k_thread_resume(data->thread_id);

	return 0;
}

static int max32664c_set_mode_wake_on_motion(const struct device *dev)
{
	uint8_t rx;
	uint8_t tx[6];
	struct max32664c_data *data = dev->data;

	LOG_DBG("MAX32664C entering wake on motion mode...");

	/* Stop the current algorithm */
	tx[0] = 0x52;
	tx[1] = 0x07;
	tx[2] = 0x00;
	if (max32664c_i2c_transmit(dev, tx, 3, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	/* Set the motion detection threshold (see Table 12 in the SpO2 and Heart Rate Using Guide)
	 */
	tx[0] = 0x46;
	tx[1] = 0x04;
	tx[2] = 0x00;
	tx[3] = 0x01;
	tx[4] = MAX32664C_MOTION_TIME(data->motion_time);
	tx[5] = MAX32664C_MOTION_THRESHOLD(data->motion_threshold);
	if (max32664c_i2c_transmit(dev, tx, 6, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	/* Set the output mode to sensor data */
	tx[0] = 0x10;
	tx[1] = 0x00;
	tx[2] = MAX32664C_OUT_SENSOR_ONLY;
	if (max32664c_i2c_transmit(dev, tx, 3, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	/* Enable the accelerometer */
	if (max32664c_acc_enable(dev, true)) {
		return -EINVAL;
	}

	data->op_mode = MAX32664C_OP_MODE_WAKE_ON_MOTION;

	return 0;
}

static int max32664c_exit_mode_wake_on_motion(const struct device *dev)
{
	uint8_t rx;
	uint8_t tx[6];
	struct max32664c_data *data = dev->data;

	LOG_DBG("MAX32664C exiting wake on motion mode...");

	/* Exit wake on motion mode */
	tx[0] = 0x46;
	tx[1] = 0x04;
	tx[2] = 0x00;
	tx[3] = 0x00;
	tx[4] = 0xFF;
	tx[5] = 0xFF;
	if (max32664c_i2c_transmit(dev, tx, 6, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	/* Disable the accelerometer */
	if (max32664c_acc_enable(dev, false)) {
		return -EINVAL;
	}

	data->op_mode = MAX32664C_OP_MODE_IDLE;

	return 0;
}

static int max32664c_disable_sensors(const struct device *dev)
{
	uint8_t rx;
	uint8_t tx[4];
	struct max32664c_data *data = dev->data;

	if (max32664c_stop_algo(dev)) {
		LOG_ERR("Failed to stop the algorithm!");
		return -EINVAL;
	}

	/* Leave wake on motion first because we disable the accelerometer */
	if (max32664c_exit_mode_wake_on_motion(dev)) {
		LOG_ERR("Failed to exit wake on motion mode!");
		return -EINVAL;
	}

	LOG_DBG("Disable the sensors...");

	/* Disable the AFE */
	tx[0] = 0x44;
	tx[1] = 0x00;
	tx[2] = 0x00;
	tx[3] = 0x00;
	if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, 250)) {
		return -EINVAL;
	}

	/* Disable the accelerometer */
	if (max32664c_acc_enable(dev, false)) {
		return -EINVAL;
	}

	data->op_mode = MAX32664C_OP_MODE_IDLE;

	return 0;
}

static int max32664c_sample_fetch(const struct device *dev, enum sensor_channel chan)
{
	struct max32664c_data *data = dev->data;

	switch (data->op_mode) {
	case MAX32664C_OP_MODE_STOP_ALGO:
	case MAX32664C_OP_MODE_IDLE:
		LOG_DBG("Device is idle, no data to fetch!");
		return -EAGAIN;
	case MAX32664C_OP_MODE_SCD:
		k_msgq_get(&data->scd_report_queue, &data->scd, K_NO_WAIT);
		return 0;
#ifdef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
	case MAX32664C_OP_MODE_ALGO_AEC_EXT:
	case MAX32664C_OP_MODE_ALGO_AGC_EXT:
		k_msgq_get(&data->ext_report_queue, &data->ext, K_NO_WAIT);
		return 0;
#else
	case MAX32664C_OP_MODE_ALGO_AEC:
	case MAX32664C_OP_MODE_ALGO_AGC:
		k_msgq_get(&data->report_queue, &data->report, K_NO_WAIT);
		return 0;
#endif /* CONFIG_MAX32664C_USE_EXTENDED_REPORTS */
	/* Raw data are reported with normal and extended algorithms so we need to fetch them too */
	case MAX32664C_OP_MODE_RAW:
		k_msgq_get(&data->raw_report_queue, &data->raw, K_NO_WAIT);
		return 0;
	default:
		return -ENOTSUP;
	}
}

static int max32664c_channel_get(const struct device *dev, enum sensor_channel chan,
				 struct sensor_value *val)
{
	struct max32664c_data *data = dev->data;

	switch ((int)chan) {
	case SENSOR_CHAN_ACCEL_X: {
		val->val1 = data->raw.acc.x;
		break;
	}
	case SENSOR_CHAN_ACCEL_Y: {
		val->val1 = data->raw.acc.y;
		break;
	}
	case SENSOR_CHAN_ACCEL_Z: {
		val->val1 = data->raw.acc.z;
		break;
	}
	case SENSOR_CHAN_GREEN: {
		val->val1 = data->raw.PPG1;
		break;
	}
	case SENSOR_CHAN_IR: {
		val->val1 = data->raw.PPG2;
		break;
	}
	case SENSOR_CHAN_RED: {
		val->val1 = data->raw.PPG3;
		break;
	}
	case SENSOR_CHAN_MAX32664C_HEARTRATE: {
#ifdef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
		val->val1 = data->ext.hr;
		val->val2 = data->ext.hr_confidence;
#else
		val->val1 = data->report.hr;
		val->val2 = data->report.hr_confidence;
#endif
		break;
	}
	case SENSOR_CHAN_MAX32664C_RESPIRATION_RATE: {
#ifdef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
		val->val1 = data->ext.rr;
		val->val2 = data->ext.rr_confidence;
#else
		val->val1 = data->report.rr;
		val->val2 = data->report.rr_confidence;
#endif
		break;
	}
	case SENSOR_CHAN_MAX32664C_BLOOD_OXYGEN_SATURATION: {
#ifdef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
		val->val1 = data->ext.spo2_meas.value;
		val->val2 = data->ext.spo2_meas.confidence;
#else
		val->val1 = data->report.spo2_meas.value;
		val->val2 = data->report.spo2_meas.confidence;
#endif
		break;
	}
	case SENSOR_CHAN_MAX32664C_SKIN_CONTACT: {
		if (data->op_mode == MAX32664C_OP_MODE_SCD) {
			val->val1 = data->scd.scd_classifier;
		} else {
			val->val1 = data->report.scd_state;
		}
		break;
	}
	default: {
		LOG_ERR("Channel %u not supported!", chan);
		return -ENOTSUP;
	}
	}

	return 0;
}

static int max32664c_attr_set(const struct device *dev, enum sensor_channel chan,
			      enum sensor_attribute attr, const struct sensor_value *val)
{
	int err;
	uint8_t tx[5];
	uint8_t rx;
	struct max32664c_data *data = dev->data;

	err = 0;

	switch ((int)attr) {
	case SENSOR_ATTR_SAMPLING_FREQUENCY: {
		break;
	}
	case SENSOR_ATTR_MAX32664C_HEIGHT: {
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x06;
		tx[3] = (val->val1 & 0xFF00) >> 8;
		tx[4] = val->val1 & 0x00FF;
		if (max32664c_i2c_transmit(dev, tx, 5, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			LOG_ERR("Can not set height!");
			return -EINVAL;
		}

		break;
	}
	case SENSOR_ATTR_MAX32664C_WEIGHT: {
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x07;
		tx[3] = (val->val1 & 0xFF00) >> 8;
		tx[4] = val->val1 & 0x00FF;
		if (max32664c_i2c_transmit(dev, tx, 5, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			LOG_ERR("Can not set weight!");
			return -EINVAL;
		}

		break;
	}
	case SENSOR_ATTR_MAX32664C_AGE: {
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x08;
		tx[3] = val->val1 & 0x00FF;
		if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			LOG_ERR("Can not set age!");
			return -EINVAL;
		}

		break;
	}
	case SENSOR_ATTR_MAX32664C_GENDER: {
		tx[0] = 0x50;
		tx[1] = 0x07;
		tx[2] = 0x09;
		tx[3] = val->val1 & 0x00FF;
		if (max32664c_i2c_transmit(dev, tx, 4, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			LOG_ERR("Can not set gender!");
			return -EINVAL;
		}

		break;
	}
	case SENSOR_ATTR_SLOPE_DUR: {
		data->motion_time = val->val1;
		break;
	}
	case SENSOR_ATTR_SLOPE_TH: {
		data->motion_threshold = val->val1;
		break;
	}
	case SENSOR_ATTR_CONFIGURATION: {
		switch ((int)chan) {
		case SENSOR_CHAN_GREEN: {
			data->led_current[0] = val->val1 & 0xFF;
			break;
		}
		case SENSOR_CHAN_IR: {
			data->led_current[1] = val->val1 & 0xFF;
			break;
		}
		case SENSOR_CHAN_RED: {
			data->led_current[2] = val->val1 & 0xFF;
			break;
		}
		default: {
			LOG_ERR("Channel %u not supported for setting attribute!", (int)chan);
			return -ENOTSUP;
		}
		}
		break;
	}
	case SENSOR_ATTR_MAX32664C_OP_MODE: {
		switch (val->val1) {
		case MAX32664C_OP_MODE_ALGO_AEC: {
#ifndef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
			err = max32664c_set_mode_algo(dev, MAX32664C_OP_MODE_ALGO_AEC, val->val2,
						      false);
#else
			return -EINVAL;
#endif /* CONFIG_MAX32664C_USE_EXTENDED_REPORTS */
			break;
		}
		case MAX32664C_OP_MODE_ALGO_AEC_EXT: {
#ifdef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
			err = max32664c_set_mode_algo(dev, MAX32664C_OP_MODE_ALGO_AEC, val->val2,
						      true);
#else
			return -EINVAL;
#endif /* CONFIG_MAX32664C_USE_EXTENDED_REPORTS */
			break;
		}
		case MAX32664C_OP_MODE_ALGO_AGC: {
#ifndef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
			err = max32664c_set_mode_algo(dev, MAX32664C_OP_MODE_ALGO_AGC, val->val2,
						      false);
#else
			return -EINVAL;
#endif /* CONFIG_MAX32664C_USE_EXTENDED_REPORTS */
			break;
		}
		case MAX32664C_OP_MODE_ALGO_AGC_EXT: {
#ifdef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
			err = max32664c_set_mode_algo(dev, MAX32664C_OP_MODE_ALGO_AGC, val->val2,
						      true);
#else
			return -EINVAL;
#endif /* CONFIG_MAX32664C_USE_EXTENDED_REPORTS */
			break;
		}
		case MAX32664C_OP_MODE_RAW: {
			err = max32664c_set_mode_raw(dev);
			break;
		}
		case MAX32664C_OP_MODE_SCD: {
			err = max32664c_set_mode_scd(dev);
			break;
		}
		case MAX32664C_OP_MODE_WAKE_ON_MOTION: {
			err = max32664c_set_mode_wake_on_motion(dev);
			break;
		}
		case MAX32664C_OP_MODE_EXIT_WAKE_ON_MOTION: {
			err = max32664c_exit_mode_wake_on_motion(dev);
			break;
		}
		case MAX32664C_OP_MODE_STOP_ALGO: {
			err = max32664c_stop_algo(dev);
			break;
		}
		case MAX32664C_OP_MODE_IDLE: {
			err = max32664c_disable_sensors(dev);
			break;
		}
		default: {
			LOG_ERR("Unsupported sensor operation mode");
			return -ENOTSUP;
		}
		}

		break;
	}
	default: {
		LOG_ERR("Unsupported sensor attribute!");
		return -ENOTSUP;
	}
	}

