zephyrproject-rtos/zephyr/drivers/sensor/adi/max32664c/max32664c.c
	return err;
}

static int max32664c_attr_get(const struct device *dev, enum sensor_channel chan,
			      enum sensor_attribute attr, struct sensor_value *val)
{
	struct max32664c_data *data = dev->data;

	switch ((int)attr) {
	case SENSOR_ATTR_MAX32664C_OP_MODE: {
		val->val1 = data->op_mode;
		val->val2 = 0;
		break;
	}
	case SENSOR_ATTR_CONFIGURATION: {
		switch ((int)chan) {
		case SENSOR_CHAN_GREEN: {
			val->val1 = data->led_current[0];
			break;
		}
		case SENSOR_CHAN_IR: {
			val->val1 = data->led_current[1];
			break;
		}
		case SENSOR_CHAN_RED: {
			val->val1 = data->led_current[2];
			break;
		}
		default: {
			LOG_ERR("Channel %u not supported for getting attribute!", (int)chan);
			return -ENOTSUP;
		}
		}
		break;
	}
	default: {
		LOG_ERR("Unsupported sensor attribute!");
		return -ENOTSUP;
	}
	}

	return 0;
}

static DEVICE_API(sensor, max32664c_driver_api) = {
	.attr_set = max32664c_attr_set,
	.attr_get = max32664c_attr_get,
	.sample_fetch = max32664c_sample_fetch,
	.channel_get = max32664c_channel_get,
};

static int max32664c_init(const struct device *dev)
{
	uint8_t tx[2];
	uint8_t rx[4];
	const struct max32664c_config *config = dev->config;
	struct max32664c_data *data = dev->data;

	if (!i2c_is_ready_dt(&config->i2c)) {
		LOG_ERR_DEVICE_NOT_READY(config->i2c.bus);
		return -ENODEV;
	}

	gpio_pin_configure_dt(&config->reset_gpio, GPIO_OUTPUT);
	gpio_pin_configure_dt(&config->mfio_gpio, GPIO_OUTPUT);

	/* Put the hub into application mode */
	LOG_DBG("Set app mode");
	gpio_pin_set_dt(&config->reset_gpio, false);
	k_msleep(20);

	gpio_pin_set_dt(&config->mfio_gpio, true);
	k_msleep(20);

	/* Wait for 50 ms (switch into app mode) + 1500 ms (initialization) */
	/* (see page 17 of the User Guide) */
	gpio_pin_set_dt(&config->reset_gpio, true);
	k_msleep(1600);

	/* Read the device mode */
	tx[0] = 0x02;
	tx[1] = 0x00;
	if (max32664c_i2c_transmit(dev, tx, 2, rx, 2, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	data->op_mode = rx[1];
	LOG_DBG("Mode: %x ", data->op_mode);
	if (data->op_mode != 0) {
		return -EINVAL;
	}

	/* Read the firmware version */
	tx[0] = 0xFF;
	tx[1] = 0x03;
	if (max32664c_i2c_transmit(dev, tx, 2, rx, 4, MAX32664C_DEFAULT_CMD_DELAY)) {
		return -EINVAL;
	}

	memcpy(data->hub_ver, &rx[1], 3);

	LOG_DBG("Version: %d.%d.%d", data->hub_ver[0], data->hub_ver[1], data->hub_ver[2]);

	if (max32664c_check_sensors(dev)) {
		return -EINVAL;
	}

	if (max32664c_init_hub(dev)) {
		return -EINVAL;
	}

#ifdef CONFIG_MAX32664C_USE_STATIC_MEMORY
	k_msgq_init(&data->raw_report_queue, data->raw_report_queue_buffer,
		    sizeof(struct max32664c_raw_report_t),
		    sizeof(data->raw_report_queue_buffer) / sizeof(struct max32664c_raw_report_t));

	k_msgq_init(&data->scd_report_queue, data->scd_report_queue_buffer,
		    sizeof(struct max32664c_scd_report_t),
		    sizeof(data->scd_report_queue_buffer) / sizeof(struct max32664c_scd_report_t));

#ifdef CONFIG_MAX32664C_USE_EXTENDED_REPORTS
	k_msgq_init(&data->ext_report_queue, data->ext_report_queue_buffer,
		    sizeof(struct max32664c_ext_report_t),
		    sizeof(data->ext_report_queue_buffer) / sizeof(struct max32664c_ext_report_t));
#else
	k_msgq_init(&data->report_queue, data->report_queue_buffer,
		    sizeof(struct max32664c_report_t),
		    sizeof(data->report_queue_buffer) / sizeof(struct max32664c_report_t));
#endif /* CONFIG_MAX32664C_USE_EXTENDED_REPORTS */
#endif /* CONFIG_MAX32664C_USE_STATIC_MEMORY */

	return 0;
}

#ifdef CONFIG_PM_DEVICE
static int max32664c_pm_action(const struct device *dev, enum pm_device_action action)
{
	switch (action) {
	case PM_DEVICE_ACTION_RESUME: {
		break;
	}
	case PM_DEVICE_ACTION_SUSPEND: {
		const struct max32664c_config *config = dev->config;

		/* Pulling MFIO high will cause the hub to enter sleep mode */
		gpio_pin_set_dt(&config->mfio_gpio, true);
		k_msleep(20);
		break;
	}
	case PM_DEVICE_ACTION_TURN_OFF: {
		uint8_t rx;
		uint8_t tx[3];

		/* Send a shut down command */
		/* NOTE: Toggling RSTN is needed to wake the device */
		tx[0] = 0x01;
		tx[1] = 0x00;
		tx[2] = 0x01;
		if (max32664c_i2c_transmit(dev, tx, 3, &rx, 1, MAX32664C_DEFAULT_CMD_DELAY)) {
			return -EINVAL;
		}
		break;
	}
	case PM_DEVICE_ACTION_TURN_ON: {
		/* Toggling RSTN is needed to turn the device on */
		max32664c_init(dev);
		break;
	}
	default: {
		return -ENOTSUP;
	}
	}

	return 0;
}
#endif /* CONFIG_PM_DEVICE */

#define MAX32664C_INIT(inst)                                                                       \
	static struct max32664c_data max32664c_data_##inst;                                        \
                                                                                                   \
	static const struct max32664c_config max32664c_config_##inst = {                           \
		.i2c = I2C_DT_SPEC_INST_GET(inst),                                                 \
		.reset_gpio = GPIO_DT_SPEC_INST_GET(inst, reset_gpios),                            \
		.mfio_gpio = GPIO_DT_SPEC_INST_GET(inst, mfio_gpios),                              \
		.spo2_calib = DT_INST_PROP(inst, spo2_calib),                                      \
		.hr_config = DT_INST_PROP(inst, hr_config),                                        \
		.spo2_config = DT_INST_PROP(inst, spo2_config),                                    \
		.use_max86141 = DT_INST_PROP(inst, use_max86141),                                  \
		.use_max86161 = DT_INST_PROP(inst, use_max86161),                                  \
		.motion_time = DT_INST_PROP(inst, motion_time),                                    \
		.motion_threshold = DT_INST_PROP(inst, motion_threshold),                          \
		.min_integration_time_idx = DT_INST_ENUM_IDX(inst, min_integration_time),          \
		.min_sampling_rate_idx = DT_INST_ENUM_IDX(inst, min_sampling_rate),                \
		.max_integration_time_idx = DT_INST_ENUM_IDX(inst, max_integration_time),          \
		.max_sampling_rate_idx = DT_INST_ENUM_IDX(inst, max_sampling_rate),                \
		.report_period = DT_INST_PROP(inst, report_period),                                \
		.led_current = DT_INST_PROP(inst, led_current),                                    \
	};                                                                                         \
                                                                                                   \
	PM_DEVICE_DT_INST_DEFINE(inst, max32664c_pm_action);                                       \
                                                                                                   \
	SENSOR_DEVICE_DT_INST_DEFINE(inst, max32664c_init, PM_DEVICE_DT_INST_GET(inst),            \
				     &max32664c_data_##inst, &max32664c_config_##inst,             \
				     POST_KERNEL, CONFIG_SENSOR_INIT_PRIORITY,                     \
				     &max32664c_driver_api)

DT_INST_FOREACH_STATUS_OKAY(MAX32664C_INIT)
